# Фильтрация данных по типу
### [Вернуться назад](https://github.com/Artexxx/Artem-python/blob/master/УЧЕБНИК/)

In [70]:
import pandas as pd
df = pd.read_csv('data/intSimple.csv')
df

   A   B   C   D   E   F   G
0  1  10  10  17   1   8  17
1  3   3   4  19  18  15   8

### 1. Filter using multiple `|`

In [14]:
df[(df["A"] == 1) | (df["A"] == 3)]

   A   B   C   D   E   F   G
0  1  10  10  17   1   8  17
1  3   3   4  19  18  15   8

### 2. Filter using `isin`

In [15]:
df[df["A"].isin([1, 3])]

   A   B   C   D   E   F   G
0  1  10  10  17   1   8  17
1  3   3   4  19  18  15   8

### 3. using `Invert ~`

In [19]:
df[~df["A"].isin([1, 3])]

Empty DataFrame
Columns: [A, B, C, D, E, F, G]
Index: []

# Фильтрация данных по типу
### [Вернуться назад](https://github.com/Artexxx/Artem-python/blob/master/УЧЕБНИК/pandasTricks/README.md)

In [64]:
import pandas as pd
df = pd.read_csv('data/dateAndString.csv', sep='\t')
df['index'] = pd.to_datetime(df['index'])
df

                index  sales  customers string_col
0 2000-01-01 00:00:00   12.0         17          A
1 2000-01-01 01:00:00    5.0          3          B
2 2000-01-01 02:00:00    3.0         19          C
3 2000-01-01 03:00:00   12.0         12          D
4 2000-01-01 04:00:00   11.0          3          E
5 2000-01-01 05:00:00   12.0          6          A
6 2000-01-01 06:00:00    5.0         10          B
7 2000-01-01 07:00:00   17.0         17          C
8 2000-01-01 08:00:00   13.0          3          D
9 2000-01-01 09:00:00   19.0          5          E

In [65]:
df.dtypes

index         datetime64[ns]
sales                float64
customers              int64
string_col            object
dtype: object

### 1. Select `numerical` columns

In [66]:
df.select_dtypes(include = "number")  \
.head()

   sales  customers
0   12.0         17
1    5.0          3
2    3.0         19
3   12.0         12
4   11.0          3

### 2. Select `datetime` columns

In [67]:
df.select_dtypes(include = ["datetime", "timedelta"])  \
.head()

                index
0 2000-01-01 00:00:00
1 2000-01-01 01:00:00
2 2000-01-01 02:00:00
3 2000-01-01 03:00:00
4 2000-01-01 04:00:00